{   "title": "Skills",
    "description": "Services I can help with",
    "skills":
        {
        "code":[
            { "name": "Python", "link": "http://www.python.org" },
            { "name": "Shell", "link": "https://ohmyz.sh/" },
            { "name": "React", "link": "https://reactjs.org/" },
            { "name": "Go", "link": "http://www.python.org" },
            { "name": "PyQT", "link": "https://doc.bccnsoft.com/docs/PyQt5/" }
        ],
        "Web":[
            { "name": "Flask", "link": "https://flask.palletsprojects.com/" },
            { "name": "Django", "link": "https://www.djangoproject.com/" },
            { "name": "Gatsby", "link": "https://www.gatsbyjs.org/" },
            { "name": "HTML" },
            { "name": "CSS" },
            { "name": "Javascript" }
        ],
        "Database":[
            { "name": "MySQL", "link": "https://www.mysql.com/" },
            { "name": "MongoDB", "link": "https://www.mongodb.com/" },
            { "name": "PostgreSQL", "link": "https://www.postgresql.org/" }
        ],
        "CG/Animation":[
            { "name": "Maya", "link": "https://www.autodesk.com/products/maya/overview" },
            { "name": "Nuke", "link": "https://www.foundry.com/products/nuke" },
            { "name": "Katana", "link": "https://www.foundry.com/products/katana" },
            { "name": "Redshift", "link": "https://www.redshift3d.com/" },
            { "name": "Renderman", "link": "https://renderman.pixar.com/" },
            { "name": "Vray", "link": "https://www.chaosgroup.com/" },
            { "name": "Deadline", "link": "https://www.awsthinkbox.com/deadline" },
            { "name": "Qube", "link": "https://www.pipelinefx.com/  " },
            { "name": "Shotgun", "link": "https://www.shotgunsoftware.com/" },
            { "name": "Pipeline" },
            { "name": "Rigging" }
        ],
        "Sys Admin":[
            { "name": "Docker", "link": "http://www.docker.com" },
            { "name": "ESXi", "link": "https://www.vmware.com/ca/products/esxi-and-esx.html" },
            { "name": "Grafana", "link": "https://grafana.com/" },
            { "name": "Promethues", "link": "https://prometheus.io/" }
        ],
        "Libraries": [
            {
                "name": "FFmpeg",
                "link": "https://ffmpeg.org/"
            },
            {
                "name": "OpenImageIO",
                "link": "http://openimageio.org/"
            },
            {
                "name": "OpenColorIO",
                "link": "https://opencolorio.org/"
            }
        ]
        },
    "help":
    [
        {
            "title": "Database Driven Pipelines",
            "description": "Databases gives speed and flexibility for the whole team: Fast artist tools, Complicated present and future predictions can be made with historical data available. Good databases I like to use are usually MongoDB and MySQL databases development, replication, backups, optimization. MySQL is create for relational data where MongoDB for fast and unsorted/dynamic data."
        },
        {
            "title": "File System IT & Cleanup",
            "description": "Very few people like to clean and even fewer like to clean other people belongings. Plus it takes time and a good understanding of the data you're about to clean. For that reason, it's best to structure the files/data in a way that makes it easier to clean later. Or even better, deploy smart and automated cleaning process. All of which to help backup, archive and monitoring of data."
        },
        {
            "title": "VM's & Dockers Services",
            "description": "Pipeline and IT using many services in the backend to help productions. Deploying and managing these services can be by deploying services using ESXi, Virtual machines, Docker."
        },
        {
            "title": "Render Farm Deployment and Management",
            "description": "Management, deploying and monitoring of render-farm can be done smartly, using automated emails/alert, production-driven queuing systems, expanding to the cloud and overall making wrangler life easier."
        },
        {
            "title": "Shotgun Integration & Advance Dashboards",
            "description": "Integrating Shotgun into the artist's workflow helps the production team to be on top of everything. Integration in tools, workflows, triggers for automation. While Shotgun pages are great, many studios end-up building custom Dashboard to better monitor their productions, with more complicated queries and tracking.."
        },
        {
            "title": "Resources Monitoring & Metrics",
            "description": "Monitoring and building metrics of the studio resources is key for savings and smart growth. Knowing the numbers behind licenses, servers, workstations helps so much. Using Grafana, Prometheus and Sentry services to collect and monitor backend/frontend services."
        },
        {
            "title": "Rendering Optimizations",
            "description": "There are many great render engines out there. Each has requires optimizations and a pipeline around it to push the render times down. Optimizations are usually caching assets, creating proxies, pre-converting textures. ."
        },
        {
            "title": "Asset Management: Proprietary NextGen Framework",
            "description": "Developing proprietary asset-frameworks is one of my passions. I put a lot of love and a rich feature set in those. To name a few of the features: Agnostic to DCC/OS. Each publish is a version, each version can be linked to other versions/asset/take, each version has a metadata, supports approval/rejection. supports smart disk-space cleanup, post-processing, farm publishing, pre-publish asset checks... and much more."

        },
        {
            "title": "Color Accurate From Start to End",
            "description": "It can be somewhat \"boring\" area in production... having a colour-accurate pipeline from end to end is the only way to guarantee quality delivery of images. Images coming out of Photoshop should flow to rendering with the correct colorspace, with as little assumptions made on the way. Add to that calibrated monitors and you're in business!."
        },
        {
            "title": "Custom Artists Tools For All DCCs",
            "description": "Artists need custom tools and support. Many steps and processes can be simplified. Free the artists do focus on \"art\" and less fighting tech challenges along the way, that makes a good goal. All of the DCC could use more tooling: Maya, Nuke, Katana, Unity, Mari, Zbrush, Mudbox..."
        }
    ]

}
